Tekla Open API Reference for Tekla Structures 2025
AnalysisModelConnectivityRule Properties
The AnalysisModelConnectivityRule type exposes the following members.
Properties
Name | Description
AnalysisModelName
 Gets or sets the analysis model name.
 (Inherited from AnalysisObject.)
AnalysisObjectType
 Gets or sets the type of the analysis object.
 (Inherited from AnalysisObject.)
FatherObject2ID
 Gets or sets the identifier of the father part.
 (Inherited from AnalysisObject.)
FatherObject2Type
 Gets or sets the type of the father object.
 (Inherited from AnalysisObject.)
FatherObjectID
 Gets or sets the identifier of the father part.
 (Inherited from AnalysisObject.)
FatherObjectType
 Gets or sets the type of the father object.
 (Inherited from AnalysisObject.)
Group1
 The group name 1 of the connectivity rule.
Group2
 The group name 2 of the connectivity rule.
ID
 Gets or sets the identifier of the analysis object.
 (Inherited from AnalysisObject.)
Linkage1
 The linkage 1 of the connectivity rule.
Linkage2
 The linkage 2 of the connectivity rule.
MagneticDistance
 The magnetic distance of the connectivity rule.
Status
 The status of the connectivity rule.
Top
See Also
Reference
AnalysisModelConnectivityRule Class
Tekla.Structures.Analysis Namespace